In [72]:
%matplotlib inline

import matplotlib
import pandas as pd
import numpy as np
import csv

train_df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')

In [73]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [74]:
train_df.drop(['Name', 'Ticket', 'Cabin'], axis=1, inplace=True)
test_df.drop(['Name', 'Ticket', 'Cabin'], axis=1, inplace=True)

In [75]:
survived_rate = train_df['Survived'].mean() * 100
print survived_rate

38.3838383838

In [76]:
train_df[train_df['Parch'] > 0].count()

PassengerId    213
Survived       213
Pclass         213
Sex            213
Age            193
SibSp          213
Parch          213
Fare           213
Embarked       213
dtype: int64

In [77]:
train_df['Age'].isnull().sort_values(ascending=False).count()

891

In [79]:
mean_age = np.mean(train_df['Age'])
train_df['Age'].fillna(mean_age)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
5      29.699118
6      54.000000
7       2.000000
8      27.000000
9      14.000000
10      4.000000
11     58.000000
12     20.000000
13     39.000000
14     14.000000
15     55.000000
16      2.000000
17     29.699118
18     31.000000
19     29.699118
20     35.000000
21     34.000000
22     15.000000
23     28.000000
24      8.000000
25     38.000000
26     29.699118
27     19.000000
28     29.699118
29     29.699118
         ...
861    21.000000
862    48.000000
863    29.699118
864    24.000000
865    42.000000
866    27.000000
867    31.000000
868    29.699118
869     4.000000
870    26.000000
871    47.000000
872    33.000000
873    47.000000
874    28.000000
875    15.000000
876    20.000000
877    19.000000
878    29.699118
879    56.000000
880    25.000000
881    33.000000
882    22.000000
883    28.000000
884    25.000000
885    39.000000
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [88]:
train_df.groupby(['Sex', 'Survived']).count()

                 PassengerId  Pclass  Age  SibSp  Parch  Fare  Embarked
Sex    Survived
female 0                  81      81   64     81     81    81        81
       1                 233     233  197    233    233   233       231
male   0                 468     468  360    468    468   468       468
       1                 109     109   93    109    109   109       109